import React from "react";
import { Header } from "../header/Header";
import { Website } from "../projects/Website";
import { Application } from "../projects/Application";

function ProjectsUA() {
  return (
    <>
      <Header
        cvBtnClass="btn-summary"
        projectsBtnClass="btn-projects"
        langEN="menu-nav"
        langUA="menu-nav active-ua"
        langRU="menu-nav"
        homeBtnClass="btn-home"
        toCV="/cv/ua"
        toProjects="/projects/ua"
        toEN="/projects/en"
        toUA="/projects/ua"
        toRU="/projects/ru"
        toHome="/cv/ua"
        cvBtnTitle="Резюме"
        projectsBtnTitle="Проекти"
        langTitleEN="EN"
        langTitleUA="UA"
        langTitleRU="RU"
        homeBtnTitle="Головна"
        homeId="summary-buttun"
        cvId="projects-buttun"
        projectsId="home-buttun"
      />
      <Website
        infoOne="Адаптивний макет сайту доставки їжі з використанням Flexbox."
        infoTwo="Форма реєстрації користувача з повною перевіркою форми."
        infoThree="Сайт юридичної фірми. З використанням Flexbox та Grid."
        infoFour="Інформаційний веб-сайт міста Одеса з описами пам'яток, новинами, подіями, історією міста тощо. Ви також можете обрати одну з трьох мов: ua, en та ru."
        infoFive="3D-слайдер з ефектом обертових елементів на мерехтливому димчастому фоні. Використання анімації та трансформації."
        infoSix="Горизонтальний слайдер з анімацією та ефектом паралакса."
        infoSeven="Анімований веб-сайт з використанням ефектів паралакса."
        infoEight="Створення списку справ за допомогою Redux, також можливість додавання та видалення справ."
        infoNine="Створення мобільного додатку з можливістю додавання та видалення різних завдань."
        infoTen="Невеликий навчальний сайт для початківців Front-end розробників. З описом властивостей, елементів, а також різними прикладами."
        infoEleven="Сайт прогнозу погоди з використанням запитів Fetch API та відображенням інформації за заданими параметрами."
        infoTwelve="Отримання інформації про автомобіль за заданим VIN-кодом за допомогою запиту Fetch API. Інформація відображається залежно від одного з трьох запитів."
        infoThirteen="Макет інтернет-магазину електрообладнання. Є можливість пошуку товару за назвою, додавання його до кошика."
        webOne="Доставка їжі"
        webTwo="Авторизація"
        webThree="HLEGAL"
        webFour="Одеса"
        webFive="3D-толстовка"
        webSix="Відьмак. Ефект паралакса"
        webSeven="Чарівний ліс. Ефект паралакса"
        webEight="Список справ"
        webNine="Диспетчер завдань"
        webTen="Вивчення фронтенд"
        webEleven="Прогноз погоди"
        webTwelve="Вінкод автомобіля"
        webThirteen="Магазин світла"
      />

      <Application
        titleAPP="Проекти додатків"
        appOne="Код області України"
        appTwo="Прогноз погоди"
        appThree="Слов'янські руни"
        appInfoOne="Мобільний додаток для пошуку регіонів України за номерним кодом автомобіля. Додаток зроблено трьома мовами. Також у програмі ви можете отримати інформацію про те, які номерні знаки існують в Україні."
        appInfoTwo="Мобільний додаток для отримання прогноза погоди за допомоги api openweathermap. Додаток зроблений на 3 мовах та має три різних стиля відображення даних. "
        appInfoThree="Slavic Runes — це не просто довідник, а повноцінний інструмент для занурення в культуру слов'янських рун. Додаток поєднує освітній контент із практичною користю: від детальних тлумачень та абетки до вбудованої клавіатури, що перекладає текст у режимі реального часу.

Особливу увагу приділено атмосфері: користувачі можуть повністю налаштувати зовнішній вигляд під себе, насолоджуючись глибоким візуальним стилем з ефектами туману та «живого лісу». Застосунок доступний чотирма мовами."
      />
    </>
  );
}
export { ProjectsUA };
